<template>
  <div class="divinationBirthday">
    <img class="game_return" src="../assets/game_home_return.png" @click="backRn" alt="">
      <div class="birthday_Input" v-if="showInput">
        <img class="input_sure" src="../assets/birthday_sure.png" alt="" @click="intoAnswer">
        <img class="input_prev" src="../assets/birthday_prev.png" alt="" @click="prev">
        <img class="year_bg" src="../assets/birthday_Year.png" alt="" >
        <span class="year_text" @click="openpicer">{{showYear}}</span>
        <img class="month_bg" src="../assets/birthday_month.png" alt="">
        <span class="month_text" @click="openpicer">{{showMonth}}</span>
        <img class="day_bg" src="../assets/birthday_month.png" alt="">
        <span class="day_text" @click="openpicer">{{showDay}}</span>
        </div>
      <div class="birthday_answer" v-if="showAnswer">
        <p class="answer">{{showMsg}}</p>
        <img class="input_prev2" src="../assets/birthday_prev.png" alt="" @click="prev2">
      </div>
  <mt-datetime-picker
          ref="picker"
          type="date"
          v-model="pickerMsg"
          :startDate="startDate"
          :endDate="endDate"
          @confirm="handleConfirm"
          >
        </mt-datetime-picker>
  </div>
</template>

<script>
import  { MessageBox }  from 'mint-ui';
export default {
  name: 'birthday',
  data () {
    return {
      showInput:true,
      showAnswer:false,
      startDate:new Date('1950-01-01'),//限定开始日期
      endDate:new Date('2008-12-31'),//限定结束日期
      pickerMsg:new Date('1995-01-01'), //弹出默认时间
      showYear:'',
      showMonth:'',
      showDay:'',
      showMsg:'',
      msgObj:{"01-01":'言承旭,陈锦鸿,葛优,堂本光一(日),安成基(韩)',"01-02":'竹野内丰(日)',"01-03":'孙耀威,蔡一智,陈冲,黄伊汶,朴素美(韩)',"01-04":'陈坤',"01-05":'黄凤仪,戚美珍',"01-06":'陆毅,黄瑞丰,朴善英(韩)',"01-07":'陈秀雯,杨恭如',"01-08":'陈明真,朴真姬(韩)',"01-09":'孙淑媚,蔡安荞,满江',"01-10":'郑惠玉',"01-11":'黄舒骏,孙艺珍(韩)',"01-12":'堂娜,齐秦,张镐哲',"01-13":'叶蕴仪',"01-14":'高雪岚,傅佩嘉,李霞,黄俊贤(韩)',"01-15":'陶虹,俞飞鸿,林美贞,朱孝天',"01-16":'苏玉华',"01-17":'李玟,王海珍',"01-18":'周杰伦,白雪',"01-19":'吕方',"01-20":'滕丽名,卓文萱,袁彩云',"01-21":'陈松伶,钟欣桐',"01-22":'许晴,王小丫',"01-23":'李心洁,汪佩蓉,王子鸣',"01-24":'翁倩玉,严宽',"01-25":'苏瑾',"01-26":'陈思成,魏晨,扎西顿珠,韩孝珠',"01-27":'范文芳,高胜美,林心如,王雪娥,钟真',"01-28":'蔡健雅',"01-29":'邓丽君,宋新妮',"01-30":'加籐纪子(日)',"01-31":'王祖贤,陈琳,林雅诗,李英爱(韩),温碧霞',
        "02-01":'叶佩雯',"02-02":'彭羚,莫少聪',"02-03":'杨千嬅,佟大为,惠英红',"02-04":'张兆辉',"02-05":'吕颂贤,申恩庆(韩)',"02-06":'钟楚红,陈娟红,蔡一杰,福山雅治(日),金国振(韩)',"02-07":'小雪,李贞贤(韩)',"02-08":'辛晓琪,张卫健',"02-09":'巫启贤,章子怡,铃木亚美(日)',"02-10":'杜德伟,李湘,金晓珍(韩)',"02-11":'王识贤,金光烈(韩),全道妍(韩),朴素娴(韩)',"02-12":'叶玉卿,顺子,詹小楠',"02-13":'胡凯莉',"02-14":'叶璇,涂善妮,胡兵,马景涛,酒井法子',"02-15":'邵兵,洪秀铉(韩)',"02-16":'陈雅伦',"02-17":'河莉秀(韩)',"02-18":'黎瑞恩,张茜,孙楠',"02-19":'罗建章',"02-20":'孙志昌(韩)',"02-21":'曾宝仪,李仁慧(韩),金荷娜(韩)',"02-22":'李英娜(韩),姜成勋(韩),苗圃',"02-23":'刘洲成',"02-24":'伍咏薇,郑少秋,金胜佑(韩)',"02-25":'刘玉婷,李绮红,金喜善(韩)',"02-26":'黄品冠,方力申,宋惠乔(韩)',"02-27":'范晓萱,邵美琪',"02-28":'黄格选,菊川怜(日)',"02-29":'饭岛爱(日)',
        "03-01":'罗中旭,金敏姬(韩)',"03-02":'杨乃文,邓萃雯,朴真星(韩)',"03-03":'徐怀钰,郭奖',"03-04":'伊能静,任泉,金桢恩(韩)',"03-05":'唐林,李慧珍',"03-06":'田中健,臧天朔,',"03-07":'徐濠萦,张东健(韩),申爱罗(韩),原子鏸',"03-08":'谢雨欣,金灿宇(韩),叶童',"03-09":'郑中基',"03-10":'李菲儿,张晨光,金洙赫',"03-11":'方季惟,阿杜,阿沁',"03-12":'赵薇,叶蓓',"03-13":'陈怡蓉,赵明明',"03-14":'文熙俊',"03-15":'刘虹桦,李政在(韩),李敏宇(韩)',"03-16":'柏原崇(日)',"03-17":'黄品源,李爱静(韩),小凡,聂远',"03-18":'蔡幸娟,范玮琪,胡军,本多ruru,张娜拉(韩),麦浚龙',"03-19":'徐若瑄,任达华,金来元(韩)',"03-20":'张可颐,郑宇成(韩)',"03-21":'贾乃亮',"03-22":'朴中勋(韩)',"03-23":'萧正楠,金民钟(韩),周涛',"03-24":'凯莎·卡索-休斯,绫濑遥,彭于晏,饶敏莉,李贞贤,张敏,洪莉娜',"03-25":'梁咏琪,陈玉莲,白智英(韩),车太贤(韩),李太兰(韩)',"03-26":'周蕙,张信哲',"03-27":'林俊杰',"03-28":'蔡琳(韩)',"03-29":'山口胜平',"03-30":'何嘉文,柯以敏,朴京林(韩)',"03-31":'赵学而,黄贯中',
        "04-01":'贾平一,毛孩',"04-02":'戴娆',"04-03":'邝文珣',"04-04":'陈乔恩,金贤政(韩)',"04-05":'申敏儿(韩)',"04-06":'张韶涵',"04-07":'成龙',"04-08":'泽尻绘里香',"04-09":'李瑶媛(韩)',"04-10":'堂本刚(日),明时彬(韩)',"04-11":'田家达',"04-12":'六小龄童',"04-13":'刘志太(韩)',"04-14":'曾志伟',"04-15":'金太宇(韩),金锡勋(韩)',"04-16":'舒淇,徐静蕾,杨思敏,陈豪',"04-17":'阮丹青,李小燕,倪睿思',"04-18":'徐峥',"04-19":'周俊伟',"04-20":'彭佳慧,赵之璧',"04-21":'金巧巧',"04-22":'戴佩妮,路嘉欣,满文军',"04-23":'天悦,思琦,张捷,袁野,程程,王滔,凌含,海峰,杨丽',"04-24":'钟汶,孙昌敏(韩),金贤珠(韩)',"04-25":'蕾妮.齐薇格',"04-26":'林忆莲',"04-27":'李翊君,宁静',"04-28":'何炅',"04-29":'王宝强',"04-30":'张宇,田丽,梅婷',
        "05-01":'陈德容',"05-02":'张震岳',"05-03":'方子璇',"05-04":'高明骏',"05-05":'吴美珩,崔江姬(韩)',"05-06":'邓健泓,李勋(韩),文瑾英(韩)',"05-07":'翁美玲,钱韦杉,田震',"05-08":'陈司翰,李小冉',"05-09":'秋尚美(韩),潘粤明',"05-10":'张玉嬿,何韵诗,金南珠(韩)',"05-11":'梁汉文,杨钰莹,陶红',"05-12":'陈安琪,曹雨,凯瑟琳·赫本，加布里埃尔·拜恩,索菲娅·科波拉',"05-13":'施易男',"05-14":'陈淑桦,曹颖',"05-15":'陈秋琳',"05-16":'邱淑贞,谷祖琳',"05-17":'王力宏',"05-18":'周润发',"05-19":'赵咏华,尹子维,吴启华',"05-20":'林瑞阳,许玮伦,美秀芝(韩)',"05-21":'陈志朋',"05-22":'miggic,Q',"05-23":'杨采妮,毛宁',"05-24":'张柏芝',"05-25":'李易峰',"05-26":'陈志朋',"05-27":'安吉丽娜朱莉',"05-28":'佘诗曼',"05-29":'诺珉宇',"05-30":'陈慧珊,王喜',"05-31":'陶莉萍,章小蕙',
        "06-01":'刘若英,金相庆(韩),李东勤(韩)',"06-02":'莫文蔚',"06-03":'伊辛巴耶娃',"06-04":'温翠萍,胡瓜,李周姬(韩),杨承琳',"06-05":'刘若英,莫文蔚',"06-06":'於娜',"06-07":'陈绮贞,张雨生,林韦君,车承元(韩),宋润亚(韩)',"06-08":'金玟(韩),万弘杰',"06-09":'孔令奇,俞小凡',"06-10":'伊丽莎白·赫莉,费丝·伊文斯,黄家驹,',"06-11":'崔智友(韩)',"06-12":'陈冠桦',"06-13":'方文琳,苏芮',"06-14":'郎朗',"06-15":'江凯文',"06-16":'梁静茹,容祖儿,黄耀明',"06-17":'黄锦雯',"06-18":'赵传',"06-19":'樊少皇',"06-20":'李嘉欣,应采儿,朴桑雅(韩)',"06-21":'杨丞琳',"06-22":'周星驰',"06-23":'任贤齐',"06-24":'陈纯甄',"06-25":'蔡时罗(韩)',"06-26":'伊雪莉,黄小桢,金恩亭(韩)',"06-27":'李度,梁朝伟,金圭丽(韩),马德钟',"06-28":'何芷缓(韩)',"06-29":'井川遥(日)',"06-30":'潘美辰,汤盈盈',
        "07-01":'琼瑶',"07-02":'吴倩莲,瞿颖',"07-03":'汤姆克鲁斯',"07-04":'胡彦斌',"07-05":'马千珊',"07-06":'林佳仪,万芳,林志炫',"07-07":'王喜,张惠春',"07-08":'陈小春,陈芷菁',"07-09":'雷颂德',"07-10":'秦汉,张学友',"07-11":'陶哲',"07-12":'郭羡妮,李秉宪(韩)',"07-13":'刘翔',"07-14":'尹馨,叶安婷',"07-15":'陈明,谢天华',"07-16":'温岚,关咏荷,刘锡明',"07-17":'陈孝萱',"07-18":'广末凉子(日)',"07-19":'陈姗妮,李宗盛,於秀琴,李冰',"07-20":'文颂娴',"07-21":'张艾嘉,许巍,康成艳(韩)',"07-22":',金芝禾(韩),於波',"07-23":'孙燕姿,伍思凯,成贤娥(韩),李铭顺',"07-24":'陈翠婷,陈纯甄,陈龙,高枫',"07-25":'万梓良',"07-26":'童安格,周笔畅',"07-27":'陈奕迅,甄子丹',"07-28":'陈慧娴,庾澄庆,廉静儿(韩)',"07-29":'徐路',"07-30":'罗志祥',"07-31":'张克帆,关心妍,濮存昕',
        "08-01":'陈妙瑛,何嘉莉,王静莹',"08-02":'鲍蕾,李鈱英(韩),吴君如',"08-03":'蔡淳佳,蒙嘉慧,李本(韩)',"08-04":'张根硕',"08-05":'王馨平,关淑怡',"08-06":'杨紫琼,曾华倩,奥莱惠(日),金相钟(韩)',"08-07":'吴建豪',"08-08":'王菲',"08-09":'张惠妹,冯德伦,霍经伦',"08-10":'周小菁,姚嘉妮',"08-11":'丁菲飞,朱镇某(韩),周镇卯(韩),苏幼贞(韩)',"08-12":'许志安,韩宰锡(韩),朴勇河(韩)',"08-13":'洪爱莉,胡海泉',"08-14":'江美琪',"08-15":'高云翔,唐笑',"08-16":'李若彤',"08-17":'林嘉欣,孟广美,陈自瑶,韩石圭(韩)',"08-18":'古巨基,宣萱,恭硕良,李升燕(韩)',"08-19":'郑秀文,叶世荣',"08-20":'刘纯燕,白岩松',"08-21":'吴辰君',"08-22":'何静',"08-23":'郭妃丽,李成宰(韩)',"08-24":'高慧君,萧亚轩,熊天平',"08-25":'刘亦菲',"08-26":'陶大宇,汪琳',"08-27":'侯湘婷,张智霖,陈柏霖,詹雯婷',"08-28":'汪明荃',"08-29":'谢霆锋,裴勇俊(韩)',"08-30":'王光良,姜培琳,周丽淇',"08-31":'张清芳,陈庆祥',
        "09-01":'江蕙,潘仪君',"09-02":'江希文,黄秋生,米雪',"09-03":'陈晓东,蒋勤勤,沈银河(韩)',"09-04":'黄日华,林保怡,袁咏仪',"09-05":'黄子华,金惠秀(韩)',"09-06":'许冠杰,陈予新,谭小环',"09-07":'陈百强,金志英(韩)',"09-08":'李宁',"09-09":'康净淳,郑裕玲,解晓东,陈采岚',"09-10":'艾敬',"09-11":'苏有朋,今井佐智子(日),刘五性(韩),丘本承(韩)',"09-12":'叶全真,张国荣,甄志强',"09-13":'陈慧琳,何润东,黄奕,韩彩英(韩)',"09-14":'柳瀚雅,曾治伦',"09-15":'蔡依林,陈洁仪,袁洁莹',"09-16":'范冰冰',"09-17":'蔡少芬,翁虹,黄大炜,龚慈恩',"09-18":'李婷宜,陈文媛',"09-19":'钟丽缇',"09-20":'黄乙玲,许茹芸,张曼玉,巫奇,安室奈美惠(日),江美仪',"09-21":'吴佩文,黄立行,林家栋',"09-22":'钱枫,罗纳尔多',"09-23":'吴绮莉,李茏怡,李美妍(韩),姚乐怡',"09-24":'关之琳,赵一豪,苏永康',"09-25":'沈星,李钟原(韩)',"09-26":'吴宗宪,郭霭明,韩红',"09-27":'许美静,王颂恩,刘德华',"09-28":'窦智孔,韩君婷',"09-29":'於台烟,沈傲君,元彬(韩)',"09-30":'叶倩文,李小璐,张文慈,陈胜龙,陈跃虎',
        "10-01":'黄韵玲,黎姿,杨林,甘成宇(韩),李学庆',"10-02":'万绮雯,卓依婷,吴大维,向海岚',"10-03":'王仁宏,柯以柔',"10-04":'吴佩慈,李蕙敏,汤宝如,吴佩慈,郑伊健,高修(韩)',"10-05":'高圆圆,宋承宪(韩),沈晓海',"10-06":'高小英(韩),柳时元(韩)',"10-07":'贾静雯,陈冠希,陈浩民',"10-08":'中山亚微梨(日)',"10-09":'李珊珊,郭晋安',"10-10":'梅艳芳',"10-11":'金城武,王建隆,裴斗娜(韩)',"10-12":'李泉,金幽美(韩)',"10-13":'刘恺威,傅明宪,松岛菜菜子(日)',"10-14":'刘松仁,邱泽,车仁彪(韩)',"10-15":'林志颖,尹孙河(韩)',"10-16":'袁泉',"10-17":'丁小芹,齐豫,许绍洋,吴文忻',"10-18":'卢巧音,周迅,吴克群,崔宇赫(韩)',"10-19":'高山峰',"10-20":'王杰,张楚,魏骏杰',"10-21":'古天乐',"10-22":'岳梅',"10-23":'林俊贤',"10-24":'金知秀(韩)',"10-25":'郭嘉璐,朱茵,俞可欣',"10-26":'郭富城,郁芳,马浚伟,陈倩倩,姜昕',"10-27":'苏慧伦,陈美',"10-28":'陈建宁,利绮,李雨寰,陈法蓉,尹天照,仓木麻衣(日),申贤俊(韩)',"10-29":'林熙蕾,陶晶莹,陈升,楚谨',"10-30":'游鸿明,安在旭(韩),全智贤(韩)',"10-31":'吴奇隆,任家萱,刘晓庆',
        "11-01":'朴信洋(韩)',"11-02":'金素妍(韩)',"11-03":'钟丽淇,林青霞,范逸臣',"11-04":'婷婷,张慧仪,朱桢,苏志燮(韩)',"11-05":'boa(韩),赵敏基(韩),朴正哲(韩)',"11-06":'郑钧',"11-07":'焦恩俊,田海蓉,金允珍(韩),李宗翰',"11-08":'朴树',"11-09":'苏有朋,江一燕',"11-10":'彭丹',"11-11":'李彩桦,天心',"11-12":'刘雪华',"11-13":'刘孜,木村佑哉,余文乐',"11-14":'郑智化',"11-15":'王秀琳,赵雅芝,何宝生',"11-16":'蓝心湄,李银珠(韩)',"11-17":'唐文龙,陈妃平',"11-18":'温兆伦,张瑶,陈羽凡',"11-19":'(tvb台庆),潘越云,罗百吉,舒高,金铭,江华',"11-20":'周慧敏',"11-21":'陈炜',"11-22":'蔡卓妍',"11-23":'黄仁颖(韩)',"11-24":'权捂钟(韩)',"11-25":'徐华凤,马艳丽',"11-26":'李玖哲',"11-27":'郭可盈,迪克牛仔,李小龙,那英',"11-28":'周慧敏,蔡卓妍',"11-29":'徐子淇',"11-30":'钟汉良,蔡晓仪,林昌廷',
        "12-01":'言承旭',"12-02":'张家辉,何美钿,刘玉玲,滨崎步(日)',"12-03":'达瑞尔·汉娜,房祖名,朱丽安·摩尔',"12-04":'葛优,孙耀威',"12-05":'许慧欣,观月亚理沙(日)',"12-06":'李克勤,周海媚,黄磊',"12-07":'李瑞希,黄威',"12-08":'刘嘉玲,林峰',"12-09":'林晓培',"12-10":'张佳佳',"12-11":'黎明,洪金宝,王思懿',"12-12":'雪儿,吴廷烨',"12-13":'福楼拜,黄宗泽',"12-14":'魏雪漫',"12-15":'张洪量,黄申惠(韩)',"12-16":'罗嘉良,欧倩怡',"12-17":'何欣穗,颜仟汶,黄湘怡',"12-18":'洪筠惠,杨坤',"12-19":'纪如璟,反町隆史(日),林文龙',"12-20":'张赫(韩)',"12-21":'吴镇宇',"12-22":'孟庭苇,周华健,蔡琴',"12-23":'大谷允保(日)',"12-24":'邝美云,费翔,崔真实(韩),黄秀贞(韩)',"12-25":'彭海桐,桥本丽香(日)',"12-26":'何念庭',"12-27":'卢春如,丁文琪',"12-28":'车婉婉,崔秀钟(韩)',"12-29":'梁小冰,何家劲',"12-30":'布朗·詹姆斯,陈红',"12-31":'巩俐,徐有贞(韩)',
        }
    }
  },
mounted() {
},
  methods: {
    intoAnswer(){
      if(this.showMonth && this.showDay){
        // console.log('展示答案页')
        this.showInput = false;
        this.showAnswer = true;
        }
      },
    openpicer(){
          this.$refs.picker.open();
      },
    prev(){
        // console.log('返回上一页')
        this.$router.push({name:'divinationHome'})
      },
    prev2(){
        // console.log('返回上一页')
        this.showAnswer = false;
        this.showInput = true;
      },
    handleConfirm(){
        console.log(this.GMTToStrDate(this.pickerMsg))
        let str = this.GMTToStrDate(this.pickerMsg)
        this.showYear = str.split(':')[0]
        this.showMonth = (str.split(':')[1]).split('-')[0]
        this.showDay = (str.split(':')[1]).split('-')[1]
        // console.log(str.split('-')[1])
        this.showMsg = this.msgObj[str.split(':')[1]]
      },
      backRn(){
      window.postMessage('gameHome');
    },
    GMTToStrDate(time) {
        if(time==''||time==null){
            return ''
        }else {
            let now = new Date(time);
            let year = now.getFullYear(); //得到年份
            let month = now.getMonth();//得到月份
            let date = now.getDate();//得到日期
            month = month + 1;
            if (month < 10) month = "0" + month;
            if (date < 10) date = "0" + date;
            let times = "";
            times = year + ":" + month + "-" + date;
            return times
        }
      },
  }
}
</script>

<style>
.divinationBirthday{position: relative;}
.game_return{position: absolute;top: 0;right: 0;left: 0;margin: auto;z-index: 600;}
.birthday_Input{background-image: url('../assets/birthday_inputCover.png');background-size: 100% 100%;height: 600px;}
.input_sure{position: absolute;top: 382px;left: 345px;width: 94px;}
.input_prev{position: absolute;top: 382px;left: 545px;width: 102px;}
.year_bg{position: absolute;top: 310px;left: 290px;width: 118px;}
.year_text{position: absolute;top: 310px;left: 290px;width: 118px;height: 40px;line-height: 40px;text-align: center;font-size: 25px}
.month_bg{position: absolute;top: 310px;left: 460px;width: 83px;}
.month_text{position: absolute;top: 310px;left: 460px;width: 83px;height: 40px;line-height: 40px;text-align: center;font-size: 25px}
.day_bg{position: absolute;top: 310px;left: 585px;width: 83px;}
.day_text{position: absolute;top: 310px;left: 585px;width: 83px;height: 40px;line-height: 40px;text-align: center;font-size: 25px}
.input_prev2{position: absolute;top: 382px;left: 461px;width: 102px;}
.birthday_answer{background-image: url('../assets/birthday_answerCover.png');background-size: 100% 100%;height: 600px;}
.answer{position: absolute;top: 310px;width: 100%;text-align: center;font-family: 'YouYuan';font-size: 40px;color: #F0FF14;letter-spacing: 2px}
/* .container{position: absolute;top: 310px;left: 290px;width: 118px;}
.el-input__inner{width: 110px} */

</style>
